# Terminal & Shell
brew "zsh"
brew "tmux"
brew "starship"
brew "stow"
brew "zsh-syntax-highlighting"

# Editor
brew "neovim"

# Search & File Tools
brew "ripgrep"
brew "fd"
brew "fzf"

# Git
brew "git"
brew "gh"

# Ruby development
brew "libyaml"
brew "openssl"

# Build tools (needed by some Neovim plugins)
brew "cmake"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Apps
cask "iterm2"
